УправлениеСдачейКвартир/src/Documents/СдачаВАренду/СдачаВАренду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдачаВАренду</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьАрендаторов</registerRecords>
  <registerRecords>AccumulationRegister.АвансыАрендаторов</registerRecords>
  <registerRecords>InformationRegister.КонтрольСдачиКвартир</registerRecords>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УправлениеСдачейКвартир/src/InformationRegisters/КонтрольСдачиКвартир/КонтрольСдачиКвартир.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольСдачиКвартир</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сдача</name>
    <type>
      <types>DocumentRef.СдачаВАренду</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеСдачейКвартир/src/Documents/СдачаВАренду/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьКоличествоДней();
	
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыПосуточноВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);
	
	ПересчитатьСумму();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПроверитьЗанятостьКвартиры() Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Квартира занята в эти даты!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПересчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ПересчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если Объект.Квартира = Неопределено Тогда
		Объект.Цена = 0
	КонецЕсли;
	
	Объект.Цена = ЦеныНаКвартирыПосуточноВызовСервера.ПолучитьЦенуНаКвартиру(Объект.Квартира);
	
	ПересчитатьСумму();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПроверитьЗанятостьКвартиры() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтрольСдачиКвартир.ДатаНачала КАК ДатаНачала,
		|	КонтрольСдачиКвартир.ДатаОкончания КАК ДатаОкончания,
		|	КонтрольСдачиКвартир.Квартира КАК Квартира,
		|	КонтрольСдачиКвартир.Сдача КАК Сдача
		|ИЗ
		|	РегистрСведений.КонтрольСдачиКвартир КАК КонтрольСдачиКвартир
		|ГДЕ
		|	КонтрольСдачиКвартир.Квартира = &Квартира
		|	И КонтрольСдачиКвартир.ДатаНачала < &ДатаОкончания
		|	И КонтрольСдачиКвартир.ДатаОкончания > &ДатаНачала";

// ToDo: Разобраться		
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		Запрос.Текст = Запрос.Текст + 
//        "|    И КонтрольСдачиКвартир.Сдача <> &ТекущаяСсылка";
//        Запрос.УстановитьПараметр("ТекущаяСсылка", Объект.Ссылка);
//	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Квартира", Объект.Квартира);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьКоличествоДней()
	
	ДатаНачала = Объект.ДатаНачала;
	ДатаОкончания = Объект.ДатаОкончания;
	
	Объект.КоличествоДней = РассчетКоличестваВремени.РассчитатьКоличествоДней(ДатаНачала, ДатаОкончания);
	
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()
	
	Сумма = Объект.КоличествоДней * Объект.Цена;
	Объект.Сумма = Сумма;
	
КонецПроцедуры



#КонецОбласти
